In [1]:
import pandas as pd

In [2]:
# Load raw data
df = pd.read_csv(r'C:\Users\oytun\Downloads\Berlin_pop_stats - Districts Residents by Evangelische Kirchen.csv', header=1)

In [3]:
df.head()

                neighbourhood  total  Germans  Foreigners
0                       Mitte  35462    33982        1480
1    Friedrichshain-Kreuzberg  24175    23425         750
2                      Pankow  40711    39678        1033
3  Charlottenburg-Wilmersdorf  47787    46518        1269
4                     Spandau  40136    39368         768

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13 entries, 0 to 12
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   neighbourhood  13 non-null     object
 1   total          13 non-null     int64
 2   Germans        13 non-null     int64
 3   Foreigners     13 non-null     int64
dtypes: int64(3), object(1)
memory usage: 548.0+ bytes

In [5]:
df.isnull().sum()

neighbourhood    0
total            0
Germans          0
Foreigners       0
dtype: int64

In [6]:
df.columns

Index(['neighbourhood', 'total', 'Germans', 'Foreigners'], dtype='object')

In [7]:
df.columns = df.columns.str.lower()

In [8]:
# Standardize the 'neighbourhood' names by replacing abbreviated or inconsistent names
# with their full, lowercase standardized versions for uniformity across the dataset.
df['neighbourhood'] = df['neighbourhood'].replace({
    'Friedrichshain-Kreuzberg': 'friedrichshainkreuzberg',
    'Charlottenburg-Wilmersdorf': 'charlottenburgwilmersdorf',
    'Tempelhof-Schöneberg': 'tempelhofschöneberg',
    'Steglitz-Zehlendorf': 'steglitzzehlendorf',
    'Marzahn-Hellersdorf': 'marzahnhellersdorf',
    'Treptow-Köpenick': 'treptowköpenick',
    'Neukölln': 'neukölln',
    'Pankow': 'pankow',
    'Lichtenberg': 'lichtenberg',
    'Reinickendorf': 'reinickendorf',
    'Mitte': 'mitte',
    'Spandau': 'spandau',
    'Berlin': 'berlin'
})

In [9]:
df.dtypes

neighbourhood    object
total             int64
germans           int64
foreigners        int64
dtype: object

In [10]:
df

                neighbourhood   total  germans  foreigners
0                       mitte   35462    33982        1480
1     friedrichshainkreuzberg   24175    23425         750
2                      pankow   40711    39678        1033
3   charlottenburgwilmersdorf   47787    46518        1269
4                     spandau   40136    39368         768
5          steglitzzehlendorf   62491    61417        1074
6         tempelhofschöneberg   53818    52894         924
7                    neukölln   39002    38292         710
8             treptowköpenick   23246    22809         437
9          marzahnhellersdorf   16846    16238         608
10                lichtenberg   17894    17132         762
11              reinickendorf   45554    44765         789
12                     berlin  447122   436518       10604

In [11]:
df.describe()

              total        germans    foreigners
count      13.00000      13.000000     13.000000
mean    68788.00000   67156.615385   1631.384615
std    114506.50515  111813.412284   2710.192722
min     16846.00000   16238.000000    437.000000
25%     24175.00000   23425.000000    750.000000
50%     40136.00000   39368.000000    789.000000
75%     47787.00000   46518.000000   1074.000000
max    447122.00000  436518.000000  10604.000000

In [12]:
# Export the cleaned and transformed DataFrame to a CSV file
df.to_csv('districts_residents_by_evangelische_kirchen.csv', index=False)